In [4]:
# Homework 1

import pandas as pd

data = {'First Name': ['Alice', 'Bob', 'Charlie', 'David'], 'Age': [25, 30, 35, 40], 'City': ['New York', 'San Francisco', 'Los Angeles', 'Chicago']} 

df = pd.DataFrame(data)

In [5]:
df

  First Name  Age           City
0      Alice   25       New York
1        Bob   30  San Francisco
2    Charlie   35    Los Angeles
3      David   40        Chicago

In [7]:
# Task 1 

df.rename(columns={'First Name': 'first_name', 'Age': 'age'}, inplace=True)

print(df)

  first_name  age           City
0      Alice   25       New York
1        Bob   30  San Francisco
2    Charlie   35    Los Angeles
3      David   40        Chicago

In [8]:
# Task 2

df.head(3)

  first_name  age           City
0      Alice   25       New York
1        Bob   30  San Francisco
2    Charlie   35    Los Angeles

In [11]:
# Task 3 

mean_age = df['age'].mean()
print(mean_age)

32.5

In [17]:
# Task 4 

columns = df[['first_name', 'City']]
print(columns)

  first_name           City
0      Alice       New York
1        Bob  San Francisco
2    Charlie    Los Angeles
3      David        Chicago

In [19]:
# Task 5

df['Salary'] = '$2000'
print(df)

  first_name  age           City Salary
0      Alice   25       New York  $2000
1        Bob   30  San Francisco  $2000
2    Charlie   35    Los Angeles  $2000
3      David   40        Chicago  $2000

In [20]:
# Task 6 

df.describe()

             age
count   4.000000
mean   32.500000
std     6.454972
min    25.000000
25%    28.750000
50%    32.500000
75%    36.250000
max    40.000000

In [1]:
# Homework 2
# Task 1

import pandas as pd

data = {
    'Month': ['Jan', 'Feb', 'Mar', 'Apr'],
    'Sales': [5000, 6000, 7500, 8000],
    'Expenses': [3000, 3500, 4000, 4500]
}

sales_and_expenses = pd.DataFrame(data)

print(sales_and_expenses)

  Month  Sales  Expenses
0   Jan   5000      3000
1   Feb   6000      3500
2   Mar   7500      4000
3   Apr   8000      4500

In [2]:
# Task 2 

max_sales = sales_and_expenses['Sales'].max()
max_expenses = sales_and_expenses['Expenses'].max()

print("Maximum Sales:", max_sales)
print("Maximum Expenses:", max_expenses)

Maximum Sales: 8000
Maximum Expenses: 4500

In [3]:
# task 3 

min_sales = sales_and_expenses['Sales'].min()
min_expenses = sales_and_expenses['Expenses'].min()

print("Minimum Sales:", min_sales)
print("Minimum Expenses:", min_expenses)

Minimum Sales: 5000
Minimum Expenses: 3000

In [4]:
# Task 4

avg_sales = sales_and_expenses['Sales'].mean()
avg_expenses = sales_and_expenses['Expenses'].mean()

print("Average Sales:", avg_sales)
print("Average Expenses:", avg_expenses)

Average Sales: 6625.0
Average Expenses: 3750.0

In [6]:
# Homework 3
# task 1

import pandas as pd

data = {
    'Category': ['Rent', 'Utilities', 'Groceries', 'Entertainment'],
    'January': [1200, 200, 300, 150],
    'February': [1300, 220, 320, 160],
    'March': [1400, 240, 330, 170],
    'April': [1500, 250, 350, 180]
}

expenses = pd.DataFrame(data)

expenses = expenses.set_index('Category')

expenses

               January  February  March  April
Category
Rent              1200      1300   1400   1500
Utilities          200       220    240    250
Groceries          300       320    330    350
Entertainment      150       160    170    180

In [7]:
# Task 2

max_expense = expenses.max(axis=1)
print("Maximum expense for each category:")
print(max_expense)
print()

Maximum expense for each category:
Category
Rent             1500
Utilities         250
Groceries         350
Entertainment     180
dtype: int64

In [8]:
# Task 3

min_expense = expenses.min(axis=1)
print("Minimum expense for each category:")
print(min_expense)
print()

Minimum expense for each category:
Category
Rent             1200
Utilities         200
Groceries         300
Entertainment     150
dtype: int64

In [9]:
# task 4

avg_expense = expenses.mean(axis=1)
print("Average expense for each category:")
print(avg_expense)

Average expense for each category:
Category
Rent             1350.0
Utilities         227.5
Groceries         325.0
Entertainment     165.0
dtype: float64